<a href="https://colab.research.google.com/github/eduardagoulart/pandas_study/blob/master/datas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Looking inside the Dataframe: columns, rows and cells

In [0]:
import pandas as pd

In [0]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv")

### How we can look at the value for one column?

In [3]:
df.longitude

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

In [4]:
df["longitude"]

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

as we can see, both ways work when you want to access the information in one column. We can access them similar as a dictionary or even as an attibute

### Access information on a Dataframe

In [5]:
df.head(10)
# show the first 10 elements

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0
5    -114.58     33.63  ...         3.3438             74000.0
6    -114.58     33.61  ...         2.6768             82400.0
7    -114.59     34.83  ...         1.7083             48500.0
8    -114.59     33.61  ...         2.1782             58400.0
9    -114.60     34.83  ...         2.1908             48100.0

[10 rows x 9 columns]

In [7]:
df.tail(10)
# show the last 10 elements

       longitude  latitude  ...  median_income  median_house_value
16990    -124.22     41.73  ...         1.7038             78300.0
16991    -124.23     41.75  ...         2.4805             73200.0
16992    -124.23     40.81  ...         3.3462             50800.0
16993    -124.23     40.54  ...         3.0806            106700.0
16994    -124.25     40.28  ...         1.9417             76100.0
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[10 rows x 9 columns]

In [9]:
df.sample(10)
# pick 10 random elements

       longitude  latitude  ...  median_income  median_house_value
10433    -120.29     36.88  ...         2.4219             83900.0
8189     -118.44     34.28  ...         2.5147            137100.0
2455     -117.60     33.85  ...         5.3006            221400.0
5875     -118.20     33.92  ...         3.0871            138800.0
11136    -121.01     37.62  ...         2.0885             73700.0
13102    -121.88     37.41  ...         4.3807            226900.0
15637    -122.36     37.92  ...         1.3929            104200.0
10587    -120.46     38.09  ...         3.0000            122600.0
12406    -121.56     38.58  ...         1.9426             82300.0
7458     -118.35     33.83  ...         6.1187            342000.0

[10 rows x 9 columns]

### How can I access more then one column at the same time?

In [10]:
df[["longitude", "latitude"]]

       longitude  latitude
0        -114.31     34.19
1        -114.47     34.40
2        -114.56     33.69
3        -114.57     33.64
4        -114.57     33.57
...          ...       ...
16995    -124.26     40.58
16996    -124.27     40.69
16997    -124.30     41.84
16998    -124.30     41.80
16999    -124.35     40.54

[17000 rows x 2 columns]

to pick multiple columns we need to use two brackets. This can take more time, since we are doing a copy of the original dataframe, but only with the selected columns.

At the example bellow, *new_df* is another dataframe, that contains information about *total rooms* and *house holds*

In [13]:
new_df = df[["households", "total_rooms"]]
new_df

       households  total_rooms
0           472.0       5612.0
1           463.0       7650.0
2           117.0        720.0
3           226.0       1501.0
4           262.0       1454.0
...           ...          ...
16995       369.0       2217.0
16996       465.0       2349.0
16997       456.0       2677.0
16998       478.0       2672.0
16999       270.0       1820.0

[17000 rows x 2 columns]

# Subsetting information

loc: based on index label (row name)

iloc: based on row index (row number)

## Loc function

In [14]:
df.loc[0]
# information from the first row

longitude              -114.3100
latitude                 34.1900
housing_median_age       15.0000
total_rooms            5612.0000
total_bedrooms         1283.0000
population             1015.0000
households              472.0000
median_income             1.4936
median_house_value    66900.0000
Name: 0, dtype: float64

In [16]:
df.loc[99]
# information from the row with index 99

longitude              -115.590
latitude                 32.850
housing_median_age       20.000
total_rooms            1608.000
total_bedrooms          274.000
population              862.000
households              248.000
median_income             4.875
median_house_value    90800.000
Name: 99, dtype: float64

I wanna access the last row, how can I do this?

In [19]:
number_of_rows = df.shape[0]
df.loc[number_of_rows - 1] # index start with 0, so to access the actual number 
# we need to subtract 1

longitude              -124.3500
latitude                 40.5400
housing_median_age       52.0000
total_rooms            1820.0000
total_bedrooms          300.0000
population              806.0000
households              270.0000
median_income             3.0147
median_house_value    94600.0000
Name: 16999, dtype: float64

In [21]:
# or using tail 
df.tail(n=1)

       longitude  latitude  ...  median_income  median_house_value
16999    -124.35     40.54  ...         3.0147             94600.0

[1 rows x 9 columns]

we can see that loc and tail function returned two different formats. The reason for that is, when we use loc we have a new Serie created with all information for that position. However, using tail, we are filtering one row for the DataFrame, and that will continue be trated as a DF.

### Subsetting multiple rows

In [22]:
df.loc[[0, 99, 1000]]

      longitude  latitude  ...  median_income  median_house_value
0       -114.31     34.19  ...         1.4936             66900.0
99      -115.59     32.85  ...         4.8750             90800.0
1000    -117.10     33.36  ...         3.2614            168800.0

[3 rows x 9 columns]

In [24]:
new_loc_df = df.loc[[0, 99, 1000]]
new_loc_df

      longitude  latitude  ...  median_income  median_house_value
0       -114.31     34.19  ...         1.4936             66900.0
99      -115.59     32.85  ...         4.8750             90800.0
1000    -117.10     33.36  ...         3.2614            168800.0

[3 rows x 9 columns]

Keep in mind that this method will take longer to finish, because we are actually creating a copy of the original dataframe, but only with the selected information (copy process are a little bit slow in Pandas)

## iloc function

iloc function works the same as loc, but takes the row index number (each row index can have different name, iloc will take the number no matter the name that uses)

In [26]:
df.iloc[1]
# takes the second row

longitude              -114.47
latitude                 34.40
housing_median_age       19.00
total_rooms            7650.00
total_bedrooms         1901.00
population             1129.00
households              463.00
median_income             1.82
median_house_value    80100.00
Name: 1, dtype: float64

In [29]:
# curiosity: to access the last row, we don't need to use any Python tools
# it can be donne only with pandas and the index -1
df.iloc[-1]

longitude              -124.3500
latitude                 40.5400
housing_median_age       52.0000
total_rooms            1820.0000
total_bedrooms          300.0000
population              806.0000
households              270.0000
median_income             3.0147
median_house_value    94600.0000
Name: 16999, dtype: float64

# Subsetting colums

how we use loc and iloc to filter coluns

In [32]:
subset = df.loc[:, ["longitude", "total_rooms"]]
# we got all the rows from df at columnd longitude and total_rooms
subset.head()

   longitude  total_rooms
0    -114.31       5612.0
1    -114.47       7650.0
2    -114.56        720.0
3    -114.57       1501.0
4    -114.57       1454.0

In [35]:
iloc_subset = df.iloc[:, [2, 4, -1]]
# using iloc, we can pass the columns number
# in this case, we create a new df with all the rows for columns: 2, 4 and the 
# last one
iloc_subset.head()

   housing_median_age  total_bedrooms  median_house_value
0                15.0          1283.0             66900.0
1                19.0          1901.0             80100.0
2                17.0           174.0             85700.0
3                14.0           337.0             73400.0
4                20.0           326.0             65500.0

## Subsetting by range

we will use a Python function to create a range of values. This way, we can specify where begin and end values are important to us. Also, all the values between the range will be included bases on the steps we specify.

In [40]:
small_list = list(range(5))
subset_range = df.iloc[:, small_list] 
subset_range

# this is the same of df.loc[:, [0, 1, 2, 3, 4]]

       longitude  latitude  housing_median_age  total_rooms  total_bedrooms
0        -114.31     34.19                15.0       5612.0          1283.0
1        -114.47     34.40                19.0       7650.0          1901.0
2        -114.56     33.69                17.0        720.0           174.0
3        -114.57     33.64                14.0       1501.0           337.0
4        -114.57     33.57                20.0       1454.0           326.0
...          ...       ...                 ...          ...             ...
16995    -124.26     40.58                52.0       2217.0           394.0
16996    -124.27     40.69                36.0       2349.0           528.0
16997    -124.30     41.84                17.0       2677.0           531.0
16998    -124.30     41.80                19.0       2672.0           552.0
16999    -124.35     40.54                52.0       1820.0           300.0

[17000 rows x 5 columns]

In [42]:
# specify the begin and end values
subset_begin_end = df.iloc[:, range(3, 7)]
subset_begin_end

       total_rooms  total_bedrooms  population  households
0           5612.0          1283.0      1015.0       472.0
1           7650.0          1901.0      1129.0       463.0
2            720.0           174.0       333.0       117.0
3           1501.0           337.0       515.0       226.0
4           1454.0           326.0       624.0       262.0
...            ...             ...         ...         ...
16995       2217.0           394.0       907.0       369.0
16996       2349.0           528.0      1194.0       465.0
16997       2677.0           531.0      1244.0       456.0
16998       2672.0           552.0      1298.0       478.0
16999       1820.0           300.0       806.0       270.0

[17000 rows x 4 columns]

before I mentioned that range works based on the begin and end we specify and the steps. So, what this means?

There is another parameter we can pass, that says how many steps we will do to pick up a column

In [44]:
subset_step = df.iloc[:, range(0, 7, 3)]
# this means we will take a column over 3 steps
subset_step

       longitude  total_rooms  households
0        -114.31       5612.0       472.0
1        -114.47       7650.0       463.0
2        -114.56        720.0       117.0
3        -114.57       1501.0       226.0
4        -114.57       1454.0       262.0
...          ...          ...         ...
16995    -124.26       2217.0       369.0
16996    -124.27       2349.0       465.0
16997    -124.30       2677.0       456.0
16998    -124.30       2672.0       478.0
16999    -124.35       1820.0       270.0

[17000 rows x 3 columns]